name: "cfw_train_test"

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_a.txt"
    batch_size: 64
    shuffle: false
  }
  transform_param {
    mean_file: "data/cfw/mean.binaryproto"
    scale: 0.00390625
    mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/cfw/cfw_test_a.txt"
    batch_size: 64
    shuffle: false
  }
  transform_param {
    mean_file: "data/cfw/mean.binaryproto"
    scale: 0.00390625
  }
  include: { phase: TEST }
}

layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_b.txt"
    batch_size: 64
    shuffle: false
  }
  transform_param {
    mean_file: "data/cfw/mean.binaryproto"
    scale: 0.00390625
    mirror: true
  }
  include: { phase: TRAIN }
}

layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/cfw/cfw_test_b.txt"
    batch_size: 64
    shuffle: false
  }
  transform_param {
    mean_file: "data/cfw/mean.binaryproto"
    scale: 0.00390625
  }
  include: { phase: TEST }
}

layers {
  type: IMPORT
  name: "a"
  import_param {
    net: "examples/cfw_v3/shared.prototxt"
    var { name: "bottom" value: "/data_a" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "b"
  import_param {
    net: "examples/cfw_v3/shared.prototxt"
    var { name: "bottom" value: "/data_b" }
    var { name: "label" value: "/label_b" }
  }
}

layers {
  type: IMPORT
  name: "a_loss"
  import_param {
    net: "examples/cfw_v3/kway.prototxt"
    var { name: "feat" value: "/a/ip1" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "b_loss"
  import_param {
    net: "examples/cfw_v3/kway.prototxt"
    var { name: "feat" value: "/b/ip1" }
    var { name: "label" value: "/label_b" }
  }
}

layers {
  type: IMPORT
  name: "same_label"
  import_param {
    net: "examples/cfw_v3/same_label.prototxt"
  }
}

layers {
  type: IMPORT
  name: "contrast"
  import_param {
    net: "examples/cfw_v3/contrast.prototxt"
  }
}

