

layer {
  name: "label_diff"
  type: "Eltwise"
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "label"
  bottom: "label_b"
  top: "label_diff"
}

layer {
    name: "absval"
    type: "AbsVal"
    bottom: "label_diff"
    top: "label_diff_abs"
}

layer {
  name: "label_diff_abs_thresh"
  type: "Threshold"
  bottom: "label_diff_abs"
  top: "same_label"
}


