
layer {
  name: "ip2_XXX"
  type: "InnerProduct"
  bottom: "fc6_XXX"
  top: "ip2_XXX"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "ip2_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "ip2_b"
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}

