
name: "CelebCaffeNet"

layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "models/celeb_siamese_v0/celeb34372_mean.binaryproto"
  }
  image_data_param {
    source: "models/celeb_siamese_v0/clusters_2_seed=0_trn_siamese.txt"
    batch_size: 50
  }
}
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_file: "models/celeb_siamese_v0/celeb34372_mean.binaryproto"
  }
  image_data_param {
    source: "models/celeb_siamese_v0/clusters_2_seed=0_tst_siamese.txt"
    batch_size: 50
  }
}


layer {
  name: "data_b"
  type: "ImageData"
  top: "data_b"
  top: "label_b"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "models/celeb_siamese_v0/celeb34372_mean.binaryproto"
  }
  image_data_param {
    source: "models/celeb_siamese_v0/clusters_2_seed=0_trn_siamese_b.txt"
    batch_size: 50
  }
}
layer {
  name: "data_b"
  type: "ImageData"
  top: "data_b"
  top: "label_b"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_file: "models/celeb_siamese_v0/celeb34372_mean.binaryproto"
  }
  image_data_param {
    source: "models/celeb_siamese_v0/clusters_2_seed=0_tst_siamese_b.txt"
    batch_size: 50
  }
}

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv1_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv1_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv2_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv2_b"
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv3_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv3_b"
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv4_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv4_b"
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv5_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv5_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "fc6_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "fc6_b"
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}

layer {
  name: "conv1_b"
  type: "Convolution"
  bottom: "data_b"
  top: "conv1_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv1_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv1_b"
  }
  convolution_param {
    num_output: 96
    kernel_size: 11
    stride: 4
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_b"
  type: "ReLU"
  bottom: "conv1_b"
  top: "conv1_b"
}
layer {
  name: "pool1_b"
  type: "Pooling"
  bottom: "conv1_b"
  top: "pool1_b"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm1_b"
  type: "LRN"
  bottom: "pool1_b"
  top: "norm1_b"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv2_b"
  type: "Convolution"
  bottom: "norm1_b"
  top: "conv2_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv2_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv2_b"
  }
  convolution_param {
    num_output: 256
    pad: 2
    kernel_size: 5
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu2_b"
  type: "ReLU"
  bottom: "conv2_b"
  top: "conv2_b"
}
layer {
  name: "pool2_b"
  type: "Pooling"
  bottom: "conv2_b"
  top: "pool2_b"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "norm2_b"
  type: "LRN"
  bottom: "pool2_b"
  top: "norm2_b"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer {
  name: "conv3_b"
  type: "Convolution"
  bottom: "norm2_b"
  top: "conv3_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv3_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv3_b"
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_b"
  type: "ReLU"
  bottom: "conv3_b"
  top: "conv3_b"
}
layer {
  name: "conv4_b"
  type: "Convolution"
  bottom: "conv3_b"
  top: "conv4_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv4_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv4_b"
  }
  convolution_param {
    num_output: 384
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu4_b"
  type: "ReLU"
  bottom: "conv4_b"
  top: "conv4_b"
}
layer {
  name: "conv5_b"
  type: "Convolution"
  bottom: "conv4_b"
  top: "conv5_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "conv5_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "conv5_b"
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    group: 2
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu5_b"
  type: "ReLU"
  bottom: "conv5_b"
  top: "conv5_b"
}
layer {
  name: "pool5_b"
  type: "Pooling"
  bottom: "conv5_b"
  top: "pool5_b"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "fc6_b"
  type: "InnerProduct"
  bottom: "pool5_b"
  top: "fc6_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "fc6_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "fc6_b"
  }
  inner_product_param {
    num_output: 1024
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer {
  name: "relu6_b"
  type: "ReLU"
  bottom: "fc6_b"
  top: "fc6_b"
}
layer {
  name: "drop6_b"
  type: "Dropout"
  bottom: "fc6_b"
  top: "fc6_b"
  dropout_param {
    dropout_ratio: 0.5
  }
}



layer {
  name: "diff_label_ab"
  type: "Eltwise"
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "label"
  bottom: "label_b"
  top: "diff_label_ab"
}

layer {
  name: "diff_label_ba"
  type: "Eltwise"
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "label_b"
  bottom: "label"
  top: "diff_label_ba"
}

layer {
  name: "diff_label_ab_thresh"
  type: "Threshold"
  bottom: "diff_label_ab"
  top: "diff_label_ab_thresh"
}

layer {
  name: "diff_label_ba_thresh"
  type: "Threshold"
  bottom: "diff_label_ba"
  top: "diff_label_ba_thresh"
}

layer {
  name: "same_label"
  type: "Eltwise"
  bottom: "diff_label_ab_thresh"
  bottom: "diff_label_ba_thresh"
  top: "same_label"
}



layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "fc7_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "fc7_b"
  }
  inner_product_param {
    num_output: 19805
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc7"
  bottom: "label"
  top: "loss"
  loss_weight: 0.5
}
layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc7"
  bottom: "label"
  top: "accuracy"
  include {
    phase: TEST
  }
}

layer {
  name: "fc7_b"
  type: "InnerProduct"
  bottom: "fc6_b"
  top: "fc7_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "fc7_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "fc7_b"
  }
  inner_product_param {
    num_output: 19805
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
  name: "loss_b"
  type: "SoftmaxWithLoss"
  bottom: "fc7_b"
  bottom: "label_b"
  top: "loss_b"
  loss_weight: 0.5
}
layer {
  name: "accuracy_b"
  type: "Accuracy"
  bottom: "fc7_b"
  bottom: "label_b"
  top: "accuracy_b"
  include {
    phase: TEST
  }
}

layer {
  name: "ip2"
  type: "InnerProduct"
  bottom: "fc6"
  top: "ip2"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "ip2_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "ip2_b"
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
  name: "ip2_b"
  type: "InnerProduct"
  bottom: "fc6_b"
  top: "ip2_b"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "ip2_w"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "ip2_b"
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}


layer {
    name: "diff"
    type: "Eltwise"
    eltwise_param {
      coeff: 1
      coeff: -1
    }
    bottom: "ip2"
    bottom: "ip2_b"
    top: "diff"
}

layer {
    name: "absval"
    type: "AbsVal"
    bottom: "diff"
    top: "absval"
}

layer {
  name: "ip3"
  type: "InnerProduct"
  bottom: "absval"
  top: "ip3"
  param {
    lr_mult: 0
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "constant"
      value: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "siamese_hinge_loss"
  type: "HingeLoss"
  bottom: "ip3"
  bottom: "same_label"
  top: "siamese_hinge_loss"
  loss_weight: 0.5
}

layer {
  name: "siamese_accuracy"
  type: "Accuracy"
  bottom: "ip3"
  bottom: "same_label"
  top: "siamese_accuracy"
}

