name: "lfw_test"

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/lfw/lfw_tst_a.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
}

layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/lfw/lfw_tst_b.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
}


layers {
  type: IMPORT
  name: "a"
  import_param {
    net: "examples/cfw_closs_top/cfw_shared.prototxt"
    var { name: "bottom" value: "/data_a" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "b"
  import_param {
    net: "examples/cfw_closs_top/cfw_shared.prototxt"
    var { name: "bottom" value: "/data_b" }
    var { name: "label" value: "/label_b" }
  }
}


layers {
  type: IMPORT
  name: "siamese_label"
  import_param {
    net: "examples/cfw_closs_top/siamese_label.prototxt"
  }
}

layers {
  type: IMPORT
  name: "siamese_contrast"
  import_param {
    net: "examples/cfw_closs_top/siamese_contrast.prototxt"
  }
}


