name: "cfw_train_test"

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_a_trunc.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
  include: { phase: TRAIN }
}

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_a_trunc.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
  include: { phase: TEST }
}


layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_b_trunc.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
  include: { phase: TRAIN }
}

layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/cfw/cfw_train_siamese_b_trunc.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
  include: { phase: TEST }
}


layers {
  type: IMPORT
  name: "a"
  import_param {
    net: "examples/cfw_closs/cfw_shared.prototxt"
    var { name: "bottom" value: "/data_a" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "b"
  import_param {
    net: "examples/cfw_closs/cfw_shared.prototxt"
    var { name: "bottom" value: "/data_b" }
    var { name: "label" value: "/label_b" }
  }
}

layers {
  type: IMPORT
  name: "a_loss"
  import_param {
    net: "examples/cfw_closs/cfw_kway.prototxt"
    var { name: "feat" value: "/a/ip1" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "siamese_contrast"
  import_param {
    net: "examples/cfw_closs/siamese_contrast.prototxt"
  }
}


