name: "lfw_test"

layers {
  name: "data_a"
  type: IMAGE_DATA
  top: "data_a"
  top: "label_a"
  image_data_param {
    source: "data/lfw/lfw_tst_a.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
}

layers {
  name: "data_b"
  type: IMAGE_DATA
  top: "data_b"
  top: "label_b"
  image_data_param {
    source: "data/lfw/lfw_tst_b.txt"
    mean_file: "data/cfw/mean.binaryproto"
    batch_size: 64
    scale: 0.00390625
    shuffle: false
  }
}


layers {
  type: IMPORT
  name: "a"
  import_param {
    net: "examples/cfw_closs/lfw_shared.prototxt"
    var { name: "bottom" value: "/data_a" }
    var { name: "label" value: "/label_a" }
  }
}

layers {
  type: IMPORT
  name: "b"
  import_param {
    net: "examples/cfw_closs/lfw_shared.prototxt"
    var { name: "bottom" value: "/data_b" }
    var { name: "label" value: "/label_b" }
  }
}



layers {
  name: "diff_label_ab"
  type: ELTWISE
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "label_a"
  bottom: "label_b"
  top: "diff_label_ab"
}

layers {
  name: "diff_label_ba"
  type: ELTWISE
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "label_b"
  bottom: "label_a"
  top: "diff_label_ba"
}

layers {
  name: "diff_label_ab_thresh"
  type: THRESHOLD
  bottom: "diff_label_ab"
  top: "diff_label_ab_thresh"
}

layers {
  name: "diff_label_ba_thresh"
  type: THRESHOLD
  bottom: "diff_label_ba"
  top: "diff_label_ba_thresh"
}


layers {
  name: "label_same"
  type: ELTWISE
  bottom: "diff_label_ab_thresh"
  bottom: "diff_label_ba_thresh"
  top: "label_same"
}


layers {
  name: "diff"
  type: ELTWISE
  eltwise_param {
    coeff: 1
    coeff: -1
  }
  bottom: "a/ip1"
  bottom: "b/ip1"
  top: "diff"
}

layers {
  name: "diff_squared"
  type: ELTWISE
  eltwise_param {
    operation: PROD
  }
  bottom: "diff"
  bottom: "diff"
  top: "diff_squared"
}


layers {
  name: "ip3"
  type: INNER_PRODUCT
  bottom: "diff_squared"
  top: "ip3"
  blobs_lr: 0
  blobs_lr: 0
  inner_product_param {
    num_output: 1
    weight_filler {
      type: "constant"
      value: 1.0
    }
    bias_filler {
      type: "constant"
      value: 0.0
    }
  }
}

layers {
  name: "ip4"
  type: INNER_PRODUCT
  bottom: "ip3"
  top: "ip4"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0.1
    }
  }
}

layers {
  name: "siamese_softmax_loss"
  type: SOFTMAX_LOSS
  bottom: "ip4"
  bottom: "label_same"
  top: "siamese_softmax_loss"
  loss_weight: 0.4
}

layers {
  name: "siamese_accuracy"
  type: ACCURACY
  bottom: "ip4"
  bottom: "label_same"
  top: "siamese_accuracy"
}


