

name: "DrSAE"
layer {
  name: "mnist"
  type: "Data"
  top: "data"
#  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_train_lmdb"
    batch_size: 64
    backend: LMDB
  }
}
layer {
  name: "mnist"
  type: "Data"
  top: "data"
#  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    scale: 0.00390625
  }
  data_param {
    source: "examples/mnist/mnist_test_lmdb"
    batch_size: 100
    backend: LMDB
  }
}



layer {
  name: "ip0"
  type: "InnerProduct"
  bottom: "data"
  top: "ip0"
  param {
    lr_mult: 0
    decay_mult: 0
    name: "w0"
  }
  param {
    lr_mult: 0
    decay_mult: 0
    name: "b0"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "constant"
      value: 0
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}



layer {
  name: "Ex"
  type: "InnerProduct"
  bottom: "data"
  top: "Ex"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.1
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}


layer {
  name: "z_000"
  type: "ReLU"
  bottom: "Ex"
  top: "z_000"
}



layer {
  name: "Sz_001"
  type: "InnerProduct"
  bottom: "z_000"
  top: "Sz_001"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_001"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_001"
  top: "Ex_Sz_001"
}

layer {
  name: "relu_001"
  type: "ReLU"
  bottom: "Ex_Sz_001"
  top: "z_001"
}


layer {
  name: "Sz_002"
  type: "InnerProduct"
  bottom: "z_001"
  top: "Sz_002"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_002"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_002"
  top: "Ex_Sz_002"
}

layer {
  name: "relu_002"
  type: "ReLU"
  bottom: "Ex_Sz_002"
  top: "z_002"
}


layer {
  name: "Sz_003"
  type: "InnerProduct"
  bottom: "z_002"
  top: "Sz_003"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_003"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_003"
  top: "Ex_Sz_003"
}

layer {
  name: "relu_003"
  type: "ReLU"
  bottom: "Ex_Sz_003"
  top: "z_003"
}


layer {
  name: "Sz_004"
  type: "InnerProduct"
  bottom: "z_003"
  top: "Sz_004"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_004"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_004"
  top: "Ex_Sz_004"
}

layer {
  name: "relu_004"
  type: "ReLU"
  bottom: "Ex_Sz_004"
  top: "z_004"
}


layer {
  name: "Sz_005"
  type: "InnerProduct"
  bottom: "z_004"
  top: "Sz_005"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_005"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_005"
  top: "Ex_Sz_005"
}

layer {
  name: "relu_005"
  type: "ReLU"
  bottom: "Ex_Sz_005"
  top: "z_005"
}


layer {
  name: "Sz_006"
  type: "InnerProduct"
  bottom: "z_005"
  top: "Sz_006"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_006"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_006"
  top: "Ex_Sz_006"
}

layer {
  name: "relu_006"
  type: "ReLU"
  bottom: "Ex_Sz_006"
  top: "z_006"
}


layer {
  name: "Sz_007"
  type: "InnerProduct"
  bottom: "z_006"
  top: "Sz_007"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_007"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_007"
  top: "Ex_Sz_007"
}

layer {
  name: "relu_007"
  type: "ReLU"
  bottom: "Ex_Sz_007"
  top: "z_007"
}


layer {
  name: "Sz_008"
  type: "InnerProduct"
  bottom: "z_007"
  top: "Sz_008"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_008"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_008"
  top: "Ex_Sz_008"
}

layer {
  name: "relu_008"
  type: "ReLU"
  bottom: "Ex_Sz_008"
  top: "z_008"
}


layer {
  name: "Sz_009"
  type: "InnerProduct"
  bottom: "z_008"
  top: "Sz_009"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_009"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_009"
  top: "Ex_Sz_009"
}

layer {
  name: "relu_009"
  type: "ReLU"
  bottom: "Ex_Sz_009"
  top: "z_009"
}


layer {
  name: "Sz_010"
  type: "InnerProduct"
  bottom: "z_009"
  top: "Sz_010"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w1"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b1"
  }
  inner_product_param {
    num_output: 400
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}

layer {
  name: "sc_010"
  type: "Eltwise"
  bottom: "Ex"
  bottom: "Sz_010"
  top: "Ex_Sz_010"
}

layer {
  name: "relu_010"
  type: "ReLU"
  bottom: "Ex_Sz_010"
  top: "z_010"
}


layer {
  name: "recon_002"
  type: "InnerProduct"
  bottom: "z_002"
  top: "recon_002"
  param {
    lr_mult: 1
    name: "w2"
  }
  param {
    lr_mult: 2
    name: "b2"
  }
  inner_product_param {
    num_output: 784
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euclidean_loss_002"
  type: "EuclideanLoss"
  bottom: "data"
  bottom: "recon_002"
  top: "euclidean_loss_002"
  loss_weight: 0.0
}

layer {
  name: "power_002"
  type: "Power"
  bottom: "z_002"
  top: "power_002"
  power_param {
    power: 0.5
    shift: 0.00000001
  }
}

layer {
  name: "sparse_loss_002"
  type: "EuclideanLoss"
  bottom: "power_002"
  bottom: "ip0"
  top: "sparse_loss_002"
  loss_weight: 0.0
}


layer {
  name: "recon_004"
  type: "InnerProduct"
  bottom: "z_004"
  top: "recon_004"
  param {
    lr_mult: 1
    name: "w2"
  }
  param {
    lr_mult: 2
    name: "b2"
  }
  inner_product_param {
    num_output: 784
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euclidean_loss_004"
  type: "EuclideanLoss"
  bottom: "data"
  bottom: "recon_004"
  top: "euclidean_loss_004"
  loss_weight: 0.0
}

layer {
  name: "power_004"
  type: "Power"
  bottom: "z_004"
  top: "power_004"
  power_param {
    power: 0.5
    shift: 0.00000001
  }
}

layer {
  name: "sparse_loss_004"
  type: "EuclideanLoss"
  bottom: "power_004"
  bottom: "ip0"
  top: "sparse_loss_004"
  loss_weight: 0.0
}


layer {
  name: "recon_006"
  type: "InnerProduct"
  bottom: "z_006"
  top: "recon_006"
  param {
    lr_mult: 1
    name: "w2"
  }
  param {
    lr_mult: 2
    name: "b2"
  }
  inner_product_param {
    num_output: 784
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euclidean_loss_006"
  type: "EuclideanLoss"
  bottom: "data"
  bottom: "recon_006"
  top: "euclidean_loss_006"
  loss_weight: 0.0
}

layer {
  name: "power_006"
  type: "Power"
  bottom: "z_006"
  top: "power_006"
  power_param {
    power: 0.5
    shift: 0.00000001
  }
}

layer {
  name: "sparse_loss_006"
  type: "EuclideanLoss"
  bottom: "power_006"
  bottom: "ip0"
  top: "sparse_loss_006"
  loss_weight: 0.0
}


layer {
  name: "recon_008"
  type: "InnerProduct"
  bottom: "z_008"
  top: "recon_008"
  param {
    lr_mult: 1
    name: "w2"
  }
  param {
    lr_mult: 2
    name: "b2"
  }
  inner_product_param {
    num_output: 784
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euclidean_loss_008"
  type: "EuclideanLoss"
  bottom: "data"
  bottom: "recon_008"
  top: "euclidean_loss_008"
  loss_weight: 0.0
}

layer {
  name: "power_008"
  type: "Power"
  bottom: "z_008"
  top: "power_008"
  power_param {
    power: 0.5
    shift: 0.00000001
  }
}

layer {
  name: "sparse_loss_008"
  type: "EuclideanLoss"
  bottom: "power_008"
  bottom: "ip0"
  top: "sparse_loss_008"
  loss_weight: 0.0
}


layer {
  name: "recon_010"
  type: "InnerProduct"
  bottom: "z_010"
  top: "recon_010"
  param {
    lr_mult: 1
    decay_mult: 1
    name: "w2"
  }
  param {
    lr_mult: 2
    decay_mult: 0
    name: "b2"
  }
  inner_product_param {
    num_output: 784
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "euclidean_loss_010"
  type: "EuclideanLoss"
  bottom: "data"
  bottom: "recon_010"
  top: "euclidean_loss_010"
  loss_weight: 1.0
}

layer {
  name: "power_010"
  type: "Power"
  bottom: "z_010"
  top: "power_010"
  power_param {
    power: 0.5
    shift: 0.00000001
  }
}

layer {
  name: "sparse_loss_010"
  type: "EuclideanLoss"
  bottom: "power_010"
  bottom: "ip0"
  top: "sparse_loss_010"
  loss_weight: 0.5
}





#layer {
#  name: "ip3"
#  type: "InnerProduct"
#  bottom: "sparse2_010"
#  top: "ip3"
#  param {
#    lr_mult: 1
#    decay_mult: 1
#  }
#  param {
#    lr_mult: 2
#    decay_mult: 0
#  }
#  inner_product_param {
#    num_output: 10
#    weight_filler {
#      type: "gaussian"
#      std: 0.01
#    }
#    bias_filler {
#      type: "constant"
#      value: 0
#    }
#  }
#}
#layer {
#  name: "softmax_loss"
#  type: "SoftmaxWithLoss"
#  bottom: "ip3"
#  bottom: "label"
#  top: "softmax_loss"
#  loss_weight: 2.0
#}
#layer {
#  name: "accuracy"
#  type: "Accuracy"
#  bottom: "ip3"
#  bottom: "label"
#  top: "accuracy"
#}
#
