
layer {
  name: "data_XXX"
  type: "ImageData"
  top: "data_XXX"
  top: "label_XXX"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_file: "models/celeb_siamese_v1/celeb34372_mean.binaryproto"
  }
  image_data_param {
    #source: "models/celeb_siamese_v1/clusters_2_seed=0_trn_siamese_XXX.txt"
    source: "models/celeb_siamese_v1/clusters_2_seed=0_trn.txt.shuf"
    #source: "models/celeb_siamese_v1/clusters_2_seed=0_trn.txt.shuf.small"
    batch_size: 20
  }
}
layer {
  name: "data_XXX"
  type: "ImageData"
  top: "data_XXX"
  top: "label_XXX"
  include {
    phase: TEST
  }
  transform_param {
    mirror: false
    mean_file: "models/celeb_siamese_v1/celeb34372_mean.binaryproto"
  }
  image_data_param {
    #source: "models/celeb_siamese_v1/clusters_2_seed=0_tst_siamese_XXX.txt"
    source: "models/celeb_siamese_v1/clusters_2_seed=0_tst.txt.shuf"
    #source: "models/celeb_siamese_v1/clusters_2_seed=0_trn.txt.shuf.small"
    batch_size: 20
  }
}

